openfoam_SSTDES_correct/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (3.1 0 0);
pressure             0;
turbulentKE          0.001;//0.0001
turbulentOmega       17.8;//1.78
turbulentEpsilon     0.0016;

// ************************************************************************* //
