openfoam_SSTDES_correct/0/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"
    frontAndBack
    {
        type            slip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 3.75e-6; 
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform 3.75e-6;
        value       uniform 3.75e-6;    
}

    lowerWall
    {
        type        nutUSpaldingWallFunction;
        value       uniform 0;    
}

    upperWall
    {
        type            slip;
    }

    ahmedGroup
    {
        type        nutUSpaldingWallFunction;
        value       uniform 0;    
}
}


// ************************************************************************* //
