openfoam_SSTDES_correct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \    /   O peration     | Version:  v2112
|   \  /    A nd           | Web:      www.OpenFOAM.org
|    \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
cellDisplacement
{
    solver          GAMG;
    smoother        GaussSeidel;
    tolerance       1e-7;
    relTol          0.01;
}

    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0.05;
        minIter         1;
    }

    pFinal
    {
        $p;
        relTol          0.01;
    }

    Phi
    {
        $p;
    };

    PhiFinal
    {
        $pFinal;
    };

    "(U|k|omega|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
        minIter         1;
    }

    "(U|k|omega|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors      20;
    pRefCell                      0;
    pRefValue                     0;
    phiRefCell                    0;
    phiRefValue                   0;
}

PIMPLE
{
    nOuterCorrectors              1;
    nCorrectors                   2;
    nNonOrthogonalCorrectors      1;
    pRefCell                      0;
    pRefValue                     0;
    phiRefCell                    0;
    phiRefValue                   0;
}

relaxationFactors
{
    fields
    {
      p               0.3;
    }
    equations
    {
        "U.*"                     0.7;
        "k.*"               0.7;
        "omega.*"               0.7;
        "nuTilda.*"               0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
