openfoam_SSTDES_correct/system/fields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \    /   O peration     | Version:  v2112
|   \  /    A nd           | Web:      www.OpenFOAM.org
|    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
   CourantNo
   {
        type            CourantNo;
        libs            ("libfieldFunctionObjects.so");
        enabled true;
        writeControl    writeTime;
   }
   vorticity
   {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        enabled true;
        writeControl    writeTime;
   }
   yplus
   {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        enabled true;
        writeControl    writeTime;
   }

   wallshearstress
   {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        enabled true;
        writeControl    writeTime;
   }
    
